renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_cmd.c
    /* ---- Search the R1 error bits. ---- */
    bit = r_sdc_sd_bit_search(status);

    if (SDC_SD_ERR != bit)
    {
        /* Detect the R1 errors, except for the AKE_SEQ_ERROR. */
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
        r_sdc_sd_set_err(card_no, g_sdc_sd_resp_err_tbl[bit]);
        return SDC_SD_ERR;
    }
    else if (p_hndl->resp_status & SDC_SD_RES_AKE_SEQ_ERROR)
    {
        /* Authentication process sequence error */
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_AKE_SEQ);
        return SDC_SD_ERR;
    }
    else
    {
        /* NOP */
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_check_resp_error() */

/**********************************************************************************************************************
* Outline      : Check R5 Response Errors
* Function Name: r_sdc_sd_check_resp5_error
* Description  : Distinguishes the error from the R5 response and then sets p_hndl->error to the error.
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   No error detected
*              : SDC_SD_ERR                             ;   Errors detected
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_check_resp5_error(uint32_t card_no)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    uint32_t          status = 0;
    int32_t           bit = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    if (SDC_SD_MEDIA_SDIO & p_hndl->media_type)
    {
        /* SDIO */
        status = (uint32_t)(p_hndl->resp_status & SDC_SD_R5_CARD_STATUS_ERR);

        /* Search the R5 error bits. */
        bit = r_sdc_sd_bit_search(status);

        /* R5 errors detected */
        if (SDC_SD_ERR != bit)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
            r_sdc_sd_set_err(card_no, g_sdc_sd_io_err_tbl[bit]);
            return SDC_SD_ERR;
        }
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_check_resp5_error() */

/**********************************************************************************************************************
* Outline      : Get Response and Check Response Errors
* Function Name: r_sdc_sd_get_resp
* Description  : Gets the response value from the RESP register.
*              : After finishing this function, start the data transfer. 
* Arguments    : uint32_t           card_no              ;   SD Card No.
*              : int32_t            resp                 ;   Command response
* Return Value : SDC_SD_SUCCESS                          ;   Successful operation
*              : SDC_SD_ERR                              ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_get_resp(uint32_t card_no, int32_t resp)
{
    sdc_sd_hndl_t * p_hndl = 0;
    uint32_t          status[4] = {0, 0, 0, 0};
    uint32_t          * p_ptr = 0;
    sdhi_get_resp_t   resp_reg;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* Select the RESP register depend on the response type. */
    switch (resp)
    {
        case SDC_SD_RESP_NON:   /* Non-response */
            /* NOP */
        break;

        case SDC_SD_RESP_R1:    /* Standard response (32-bit length) */
        case SDC_SD_RESP_R1b:   /* Standard response  (32-bit length) with the busy signal */
            /* SDC_SD_RESP_R1 and SDC_SD_RESP_R1b are contained. */
            R_SDHI_GetResp(p_hndl->channel, &resp_reg);
            status[0] = resp_reg.sdrsp10;
            p_hndl->resp_status = status[0];

            /* Support to mount a locked card. */
            if (status[0] & SDC_SD_RES_ERR_IGNORE_LOCK)        /* Ignore the card locked status. */
            {
                /* Any status error */
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
                return r_sdc_sd_check_resp_error(card_no);
            }
        break;

        case SDC_SD_RESP_R1_SCR:    /* Standard response (32-bit length) with the busy signal */
            R_SDHI_GetResp(p_hndl->channel, &resp_reg);
            p_hndl->scr[0] = resp_reg.sdrsp10;
        break;

        case SDC_SD_RESP_R2_CID:    /* CID register (128-bit length) */
            R_SDHI_GetResp(p_hndl->channel, &resp_reg);
            status[3] = resp_reg.sdrsp76;
            status[2] = resp_reg.sdrsp54;
            status[1] = resp_reg.sdrsp32;
            status[0] = resp_reg.sdrsp10;

            p_ptr = p_hndl->cid;
            *p_ptr++ = ((status[3] << SDC_SD_BIT_SHIFT_8) | (status[2] >> SDC_SD_BIT_SHIFT_24));
            *p_ptr++ = ((status[2] << SDC_SD_BIT_SHIFT_8) | (status[1] >> SDC_SD_BIT_SHIFT_24));
            *p_ptr++ = ((status[1] << SDC_SD_BIT_SHIFT_8) | (status[0] >> SDC_SD_BIT_SHIFT_24));
            *p_ptr++ = (status[0] << SDC_SD_BIT_SHIFT_8);
        break;

        case SDC_SD_RESP_R2_CSD:    /* CSD register (128-bit length) */
            R_SDHI_GetResp(p_hndl->channel, &resp_reg);
            status[3] = resp_reg.sdrsp76;
            status[2] = resp_reg.sdrsp54;
            status[1] = resp_reg.sdrsp32;
            status[0] = resp_reg.sdrsp10;

            p_ptr = p_hndl->csd;
            *p_ptr++ = ((status[3] << SDC_SD_BIT_SHIFT_8) | (status[2] >> SDC_SD_BIT_SHIFT_24));
            *p_ptr++ = ((status[2] << SDC_SD_BIT_SHIFT_8) | (status[1] >> SDC_SD_BIT_SHIFT_24));
            *p_ptr++ = ((status[1] << SDC_SD_BIT_SHIFT_8) | (status[0] >> SDC_SD_BIT_SHIFT_24));
            *p_ptr++ = (status[0] << SDC_SD_BIT_SHIFT_8);
        break;

        case SDC_SD_RESP_R3:    /* OCR register (32-bit length) */
            R_SDHI_GetResp(p_hndl->channel, &resp_reg);
            p_hndl->ocr[0] = resp_reg.sdrsp10;
        break;

        case SDC_SD_RESP_R4:    /* IO OCR register (24-bit length) */
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)
            R_SDHI_GetResp(p_hndl->channel, &resp_reg);
            p_hndl->io_ocr[0] = resp_reg.sdrsp10;
#endif /* SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO */
        break;

        case SDC_SD_RESP_R6:        /* Published RCA response (16-bit length) */
            R_SDHI_GetResp(p_hndl->channel, &resp_reg);
            p_hndl->rca[0] = (resp_reg.sdrsp10 & SDC_SD_R6_NEW_PUBLISHED_RCA);
        break;

